/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "main": {
      "type": "main-page",
      "disabled": true,
      "settings": {
        "padding_top": 28,
        "padding_bottom": 28
      }
    },
    "gk_about_feature_NcbxQh": {
      "type": "gk-about-feature",
      "name": "GK About Feature",
      "settings": {
        "enable_animation": true,
        "eyebrow": "",
        "heading": "About Greg",
        "image": "shopify://shop_images/gregkoch-hallway-1317-2025cjfoeckler.jpg",
        "photo_credit": "above photo credit: ©2025CJFoeckler",
        "subheading": ".",
        "body": "<p>It is not a stretch to say that Milwaukee native Greg Koch is one of the most famous unknown guitar players in the world. His fierce creative spirit and crazed sense of fun fused with a tremendous degree of versatility has made him an island of six-stringed mirth in a sea of guitar warlords. Fifteen critically acclaimed CD’s featuring his unique and incendiary brand of playing and composing, international tours as band leader, fourteen best-selling guitar instructional materials for the Hal Leonard Publishing empire, articles and columns in some the biggest guitar magazines, a lengthy past tenure as an ambassador for Fender Guitars and a similar position in that capacity for Fishman Transducers has generated a respectable following for Greg throughout the world. Ultimately, Greg's 4000 plus videos exceeding 50 million views for Wildwood Guitars of Louisville Colorado showcasing Greg’s wild guitar test drives and random humorous commentary have made him a household name for guitar players throughout the galaxy.​<br/>​</p><p>Greg’s latest original music outlet, The Koch-Marshall Trio, is perhaps the best vehicle yet to convey his bold improvisational explorations and ever increasing arsenal of original material. The trio blends the explosive guitar manipulations of Greg, the groove-centric, power-pocket playing of his son Dylan on drums (who share many telepathic musical moments) and the glorious, Hammond organ stylings of the uber-talented Toby Marshall, Greg’s compositions are properly portrayed in the blues drenched, funk, chicken-fried, gospelly, jazz-rock panorama in which they were conceived. Their first release, “Toby Arrives” will be released in the February 23, 2018 on the Mascot Label Group / Players Club Imprint and features the first moments of their unexpected musical partnership captured at an extemporaneous jam session earlier in the year. </p>",
        "button_label": ".",
        "button_link": "",
        "accent": "#E8690A",
        "padding_top": 40,
        "padding_bottom": 52
      }
    },
    "gk_about_gallery_Yn9Rwx": {
      "type": "gk-about-gallery",
      "name": "GK About Gallery",
      "settings": {
        "enable_animation": true,
        "eyebrow": "",
        "heading": "About the Koch Marshall Trio",
        "main_image": "shopify://shop_images/gregkoch-couch-1025-2025cjfoeckler_orig.jpg",
        "main_credit": "above photo credit: ©2025CJFoeckler",
        "thumb_1": "shopify://shop_images/IMG_4137.jpg",
        "thumb_alt_1": ".",
        "thumb_2": "shopify://shop_images/Untitled_design.jpg",
        "thumb_alt_2": ".",
        "thumb_3": "shopify://shop_images/unnamed_2.jpg",
        "thumb_alt_3": ".",
        "thumb_alt_4": ".",
        "body": "<p>Add your updated copy here. This is editable in the theme editor.</p>",
        "accent": "#E8690A",
        "padding_top": 44,
        "padding_bottom": 52
      }
    }
  },
  "order": [
    "main",
    "gk_about_feature_NcbxQh",
    "gk_about_gallery_Yn9Rwx"
  ]
}
